In [3]:
import pandas as pd

In [5]:
df=pd.read_csv('g:/dataset/analysis/clothes.txt')
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   Small     11     monte
4  medium     10  cantabil
5  Medium     10       cob

In [6]:
df=pd.read_csv('g:/dataset/analysis/clothes1.txt')
df

     size:price:brand
0        small:10:cob
1     medium:12:peter
2      large:15:monte
3      small:11:monte
4  medium:10:cantabil
5       medium:10:cob

In [7]:
df=pd.read_csv('g:/dataset/analysis/clothes1.txt',sep=":")
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   small     11     monte
4  medium     10  cantabil
5  medium     10       cob

In [10]:
df=pd.read_csv('g:/dataset/analysis/clothes2.txt',sep="\t")
df

     size  price     brand
0   small     10       cob
1  medium     12     peter
2   large     15     monte
3   small     11     monte
4  medium     10  cantabil
5  medium     10     monte

In [11]:
df=pd.read_csv('g:/dataset/analysis/clothes1.txt')
df

     size:price:brand
0        small:10:cob
1     medium:12:peter
2      large:15:monte
3      small:11:monte
4  medium:10:cantabil
5       medium:10:cob

In [12]:
df=pd.read_csv('g:/dataset/analysis/clothes2.txt')
df

     size\tprice\tbrand
0        small\t10\tcob
1     medium\t12\tpeter
2      large\t15\tmonte
3      small\t11\tmonte
4  medium\t10\tcantabil
5     medium\t10\tmonte

In [13]:
df=pd.read_csv('g:/dataset/analysis/clothes3.txt')
df

    small  10       cob
0  medium  12     peter
1   large  15       NaN
2   small  11     monte
3  medium  10  cantabil
4  medium  10       cob

In [14]:
df=pd.read_csv('g:/dataset/analysis/clothes3.txt')
df

    small  10       cob
0  medium  12     peter
1   large  15       NaN
2   small  11     monte
3  medium  10  cantabil
4  medium  10       cob

In [17]:
df=pd.read_csv('g:/dataset/analysis/restaurant.csv')
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [19]:
bill=df['total_bill']
type(bill)

pandas.core.series.Series

In [20]:
bill.dtype

dtype('float64')

In [21]:
bill

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [22]:
bill.values

array([16.99, 10.34, 21.01, 23.68, 24.59, 25.29,  8.77, 26.88, 15.04,
       14.78, 10.27, 35.26, 15.42, 18.43, 14.83, 21.58, 10.33, 16.29,
       16.97, 20.65, 17.92, 20.29, 15.77, 39.42, 19.82, 17.81, 13.37,
       12.69, 21.7 , 19.65,  9.55, 18.35, 15.06, 20.69, 17.78, 24.06,
       16.31, 16.93, 18.69, 31.27, 16.04, 17.46, 13.94,  9.68, 30.4 ,
       18.29, 22.23, 32.4 , 28.55, 18.04, 12.54, 10.29, 34.81,  9.94,
       25.56, 19.49, 38.01, 26.41, 11.24, 48.27, 20.29, 13.81, 11.02,
       18.29, 17.59, 20.08, 16.45,  3.07, 20.23, 15.01, 12.02, 17.07,
       26.86, 25.28, 14.73, 10.51, 17.92, 27.2 , 22.76, 17.29, 19.44,
       16.66, 10.07, 32.68, 15.98, 34.83, 13.03, 18.28, 24.71, 21.16,
       28.97, 22.49,  5.75, 16.32, 22.75, 40.17, 27.28, 12.03, 21.01,
       12.46, 11.35, 15.38, 44.3 , 22.42, 20.92, 15.36, 20.49, 25.21,
       18.24, 14.31, 14.  ,  7.25, 38.07, 23.95, 25.71, 17.31, 29.93,
       10.65, 12.43, 24.08, 11.69, 13.42, 14.26, 15.95, 12.48, 29.8 ,
        8.52, 14.52, 11.38, 22.82, 19.08, 20.27, 11.17, 12.26, 18.26,
        8.51, 10.33, 14.15, 16.  , 13.16, 17.47, 34.3 , 41.19, 27.05,
       16.43,  8.35, 18.64, 11.87,  9.78,  7.51, 14.07, 13.13, 17.26,
       24.55, 19.77, 29.85, 48.17, 25.  , 13.39, 16.49, 21.5 , 12.66,
       16.21, 13.81, 17.51, 24.52, 20.76, 31.71, 10.59, 10.63, 50.81,
       15.81,  7.25, 31.85, 16.82, 32.9 , 17.89, 14.48,  9.6 , 34.63,
       34.65, 23.33, 45.35, 23.17, 40.55, 20.69, 20.9 , 30.46, 18.15,
       23.1 , 15.69, 19.81, 28.44, 15.48, 16.58,  7.56, 10.34, 43.11,
       13.  , 13.51, 18.71, 12.74, 13.  , 16.4 , 20.53, 16.47, 26.59,
       38.73, 24.27, 12.76, 30.06, 25.89, 48.33, 13.27, 28.17, 12.9 ,
       28.15, 11.59,  7.74, 30.14, 12.16, 13.42,  8.58, 15.98, 13.42,
       16.27, 10.09, 20.45, 13.28, 22.12, 24.01, 15.69, 11.61, 10.77,
       15.53, 10.07, 12.6 , 32.83, 35.83, 29.03, 27.18, 22.67, 17.82,
       18.78])

In [23]:
import numpy as np

In [26]:
a=np.arange(10,20)
print(a)

[10 11 12 13 14 15 16 17 18 19]

In [30]:
s=pd.Series(a)
s

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [31]:
df2=df[['total_bill','time','gender']]
df2

     total_bill    time  gender
0         16.99  Dinner  Female
1         10.34  Dinner    Male
2         21.01  Dinner    Male
3         23.68  Dinner    Male
4         24.59  Dinner  Female
..          ...     ...     ...
239       29.03  Dinner    Male
240       27.18  Dinner  Female
241       22.67  Dinner    Male
242       17.82  Dinner    Male
243       18.78  Dinner  Female

[244 rows x 3 columns]

In [32]:
df[['total_bill']]

     total_bill
0         16.99
1         10.34
2         21.01
3         23.68
4         24.59
..          ...
239       29.03
240       27.18
241       22.67
242       17.82
243       18.78

[244 rows x 1 columns]